package com.example.quizapp

object setData {

    const val name:String="name"
    const val score:String="score"


    fun getQuestion():ArrayList<QuestionData>{
        var que:ArrayList<QuestionData> = arrayListOf()

        var question1 = QuestionData(
            1,
            "Πόσες φορές την εβδομάδα αγοράζετε νέα ηλεκτρονικά προϊόντα;",

            "Καθημερινά",
            "Μια φορά την εβδομάδα",
            "Μια φορά το μήνα",
            "Μια φορά το τρίμηνο",
            "Σπάνια ή ποτέ",
            10,
            20,
            30,
            40,
            50
        )
        var question2 = QuestionData(
            2,
            "Πόσες φορές την εβδομάδα αγοράζετε μη ανακυκλώσιμα προιόντα",

            "Καθημερινά",
            "Μια φορά την εβδομάδα",
            "Μια φορά το μήνα",
            "Μια φορά το τρίμηνο",
            "Σπάνια ή ποτέ",
            10,
            20,
            30,
            40,
            50

            )
        var question3 = QuestionData(
            3,
            "Πόσο συχνά ανακυκλώνετε τα απορρίμματά σας;",

            "Καθημερινά",
            "Δυο φορές την εβδομάδα",
            "Μια φορά την εβδομάδα",
            "Μια φορά το μήνα",
            "Δεν ανακυκλώνω",
            50,
            40,
            30,
            20,
            10

        )

        var question4 = QuestionData(
            4,
            "Πόσες φορές την εβδομάδα χρησιμοποιείτε μεταφορικά μέσα " +
                    "με καυστήρα εσωτερικής καύσης (π.χ. αυτοκίνητο, μοτοσικλέτα);",

            "Πολύ συχνά",
            "Συχνά",
            "Μετρίως συχνά",
            "Σπάνια",
            "Ποτέ",
            50,
            40,
            30,
            20,
            10

        )

        var question5 = QuestionData(
            5,
            "Πόσο συχνά απενεργοποιείτε ηλεκτρικές συσκευές όταν δεν τις χρησιμοποιείτε;",

            "Πολύ συχνά",
            "Συχνά",
            "Μετρίως συχνά",
            "Σπάνια",
            "Ποτέ",
            50,
            40,
            30,
            20,
            10

        )
        var question6 = QuestionData(
            6,
            "Τι ενεργειακής κλάσης συσκευές χρησιμοποιείτε;",

            "Κλάσης Α",
            "Κλάσης Β",
            "Κλάσης Γ",
            "Κλάσης Δ",
            "Κλάσης Ε",
            50,
            40,
            30,
            20,
            10

        )
        var question7 = QuestionData(
            7,
            "Πώς απορρίπτετε τα παλιά ηλεκτρονικά σας;",

            "Τα απορρίπτω σωστά σε συλλογικά συστήματα ανακύκλωσης",
            "Τα παραδίδω σε επίσημα σημεία συλλογής ηλεκτρονικών αποβλήτων",
            "Τα πουλώ ή τα δίνω σε κάποιον που τα χρειάζεται",
            "Τα πετάω με τα οικιακά απορρίμματα",
            "Δεν έχω απορρίψει ποτέ μου",
            50,
            40,
            30,
            20,
            10

        )


        var question8 = QuestionData(
            8,
            "Πόσο συχνά προτιμάτε να αγοράζετε βιοδιασπώμενα ή φιλικά προς το περιβάλλον προϊόντα;",

            "Πάντα",
            "Συχνά",
            "Μερικές φορές",
            "Σπάνια",
            "Ποτέ",
            50,
            40,
            30,
            20,
            10

        )

        var question9 = QuestionData(
            9,
            "Πόσο συχνά επιλέγετε να αγοράζετε μεταχρησιμοποιημένα προϊόντα;",

            "Πάντα",
            "Συχνά",
            "Μερικές φορές",
            "Σπάνια",
            "Ποτέ",
            50,
            40,
            30,
            20,
            10

        )


        var question10 = QuestionData(
            10,
            "Πώς αντιμετωπίζετε την περίοδο ισχύος των τροφίμων και των προϊόντων;",

            "Αγοράζω μόνο την ποσότητα που χρειάζομαι",
            "Απορρίπτω τα προϊόντα που έχουν λήξει",
            "Προτιμώ προϊόντα με μεγαλύτερη διάρκεια ζωής",
            "Αναζητώ τρόπους για να τα επαναχρησιμοποιήσω ή να τα ανακυκλώσω",
            "Προσπαθώ να τα καταναλώσω όσο το γρηγορότερο νωρίτερα",
            50,
            10,
            30,
            50,
            20

        )

        que.add(question1)
        que.add(question2)
        que.add(question3)
        que.add(question4)
        que.add(question5)
        que.add(question6)
        que.add(question7)
        que.add(question8)
        que.add(question9)
        que.add(question10)
        return que
    }
}